In [2]:
from MySQLdb import connect
import pandas as pd

/var/folders/fb/xl0hnskx527bfqkv38l3sn7h0000gn/T/ipykernel_9735/3687392072.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [3]:
# Connect to your MySQLdb
#conn = connect(host='localhost', user='root')
conn = connect(host='127.0.0.1', user='root', password = 'root', port = 8890)

In [4]:
# Open a cursor to perform database operations
cur = conn.cursor()

In [5]:
# Return data from the Customers table:
cur.execute('''SHOW DATABASES;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

             Database
0  information_schema
1               mysql
2  performance_schema
3              sqlw3s
4                 sys
5              testDB

### SQL UNIQUE Constraint
The UNIQUE constraint ensures that all values in a column are different.

Both the UNIQUE and PRIMARY KEY constraints provide a guarantee for uniqueness for a column or set of columns.

A PRIMARY KEY constraint automatically has a UNIQUE constraint.

However, you can have many UNIQUE constraints per table, but only one PRIMARY KEY constraint per table.

SQL UNIQUE Constraint on CREATE TABLE

In [14]:
cur.execute('''DROP TABLE testDB.Persons;''')

0

In [15]:
# The following SQL creates a UNIQUE constraint on the "ID" column when the "Persons" table is created:
cur.execute('''CREATE TABLE testDB.Persons (
    ID int NOT NULL,
    LastName varchar(255) NOT NULL,
    FirstName varchar(255),
    Age int,
    UNIQUE (ID)
);''')

0

In [9]:
cur.execute('''DROP TABLE testDB.Persons;''')

0

In [11]:
# To name a UNIQUE constraint, and to define a UNIQUE constraint on multiple columns, use the following SQL syntax:
cur.execute('''CREATE TABLE testDB.Persons (
    ID int NOT NULL,
    LastName varchar(255) NOT NULL,
    FirstName varchar(255),
    Age int,
    CONSTRAINT UC_Person UNIQUE (ID,LastName)
);''')

0

- SQL UNIQUE Constraint on ALTER TABLE
To create a UNIQUE constraint on the "ID" column when the table is already created, use the following SQL:

MySQL / SQL Server / Oracle / MS Access:

ALTER TABLE Persons
ADD UNIQUE (ID);
To name a UNIQUE constraint, and to define a UNIQUE constraint on multiple columns, use the following SQL syntax:

MySQL / SQL Server / Oracle / MS Access:

ALTER TABLE Persons
ADD CONSTRAINT UC_Person UNIQUE (ID,LastName);

DROP a UNIQUE Constraint
To drop a UNIQUE constraint, use the following SQL:

MySQL:

ALTER TABLE Persons
DROP INDEX UC_Person;

SQL Server / Oracle / MS Access:

ALTER TABLE Persons
DROP CONSTRAINT UC_Person;

--postgre je stejn√©
ALTER TABLE public.bill6 ADD CONSTRAINT unique_constraint UNIQUE (id);
ALTER TABLE public.bill7 DROP CONSTRAINT bill7_pkey;

In [12]:
# In MySQL, nullability is a part of the datatype, not a constraint. So:
cur.execute('''ALTER TABLE testDB.Persons ADD CONSTRAINT unique_constraint UNIQUE (id);''')

0

In [13]:
# Return data from the CustomersNew table:
cur.execute('''SELECT * FROM testDB.Persons;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
columns = [i[0] for i in cur.description]
if len(df) == 0: df = pd.DataFrame([["" for i in range(len(columns))]])
df.columns = columns
df

  ID LastName FirstName Age
0

In [8]:
# Return data from the Customers table:
cur.execute('''DESCRIBE testDB.Persons;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
columns = [i[0] for i in cur.description]
if len(df) == 0: df = pd.DataFrame([["" for i in range(len(columns))]])
df.columns = columns
df

       Field          Type Null  Key Default Extra
0         ID       int(11)   NO  PRI    None
1   LastName  varchar(255)   NO         None
2  FirstName  varchar(255)  YES         None
3        Age       int(11)  YES         None

In [15]:
cur.execute('''INSERT INTO testDB.Persons VALUES (1, 'Cooper', '√Ålice', null); ''')

1

In [16]:
# Return data from the CustomersNew table:
cur.execute('''SELECT * FROM testDB.Persons;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
columns = [i[0] for i in cur.description]
if len(df) == 0: df = pd.DataFrame([["" for i in range(len(columns))]])
df.columns = columns
df

   ID LastName FirstName   Age
0   1   Cooper     √Ålice  None

In [17]:
cur.execute('''INSERT INTO testDB.Persons VALUES (1, 'Cooper', '√Ålice', null); ''')

IntegrityError: (1062, "Duplicate entry '1-Cooper' for key 'UC_Person'")

In [18]:
cur.execute('''INSERT INTO testDB.Persons VALUES (2, 'Cooper', '√Ålice', null); ''')

1

In [19]:
# Return data from the CustomersNew table:
cur.execute('''SELECT * FROM testDB.Persons;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
columns = [i[0] for i in cur.description]
if len(df) == 0: df = pd.DataFrame([["" for i in range(len(columns))]])
df.columns = columns
df

   ID LastName FirstName   Age
0   1   Cooper     √Ålice  None
1   2   Cooper     √Ålice  None

In [20]:
cur.execute('''INSERT INTO testDB.Persons VALUES (2, 'AAA', 'BBB', null); ''')

IntegrityError: (1062, "Duplicate entry '2' for key 'unique_constraint'")